app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."completion_date" ASC, "tasks"."updated_at" ASC, "tasks"."completion_date" DESC
---
  def index
    @tasks = Task.all.order(completion_date: :desc)

INSERT INTO "tasks" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Laundryyyy"], ["description", "nooooo"], ["created_at", "2018-09-20 06:02:51.552346"], ["updated_at", "2018-09-20 06:02:51.552346"]]
---
  def create
    @task = Task.new(task_params)
    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def edit
    @task = Task.find_by(id: params[:id].to_i)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "nooot again"], ["updated_at", "2018-09-20 21:59:08.280367"], ["id", 8]]
---
  def update
    @task = Task.find_by(id: params[:id].to_i)
    if @task.update(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 15]]
---
  def destroy
    if Task.destroy(params[:id].to_i)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", "2018-09-20"], ["updated_at", "2018-09-20 22:00:36.342617"], ["id", 13]]
---
  def mark_complete
    @task = Task.find_by(id: params[:id].to_i)
    @task.completion_date = Date.today
    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", nil], ["updated_at", "2018-09-20 22:00:39.830876"], ["id", 13]]
---
  def undo_mark_complete
    @task = Task.find_by(id: params[:id].to_i)
    @task.completion_date = nil
    if @task.save